# Pandas- DataFrame and series

Pandas is a powerful data manipulation library in python, widely used for data analysis and data cleaning. 
- It provides two primary data structure:- Series and DataFrame.
- A series is a one dimensional array like object, while a Dataframe is two dimensional, size - mutable, and potentially heterogeneous tabular data structure with labeled axes(rows and coloumns)

In [2]:
import pandas as pd

* Series :-
A pandas series is a one dimensional array like object that can hold any data type .It is similar to a column in a table

In [3]:
data=[198,223,365,498,598]
series=pd.Series(data)
print("Series \n",series)

Series
 0    198
1    223
2    365
3    498
4    598
dtype: int64

In [4]:
#Create a series from dictionary
data={'a':1,'b':2,'c':3}
series_dict=pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [5]:
data=[10,20,30,40,50]
index=['a','b','c','d','e']
pd.Series(data,index=index)

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [6]:
#DataFrame
#Create a dataframe from a dictionary of list

data={
    'name':['shruti','soham','nandini'],
    'age':[25,30,45],
    'city':['Mumbai','pune','dhule']
}
df=pd.DataFrame(data)
print(df)
print(type(df))

      name  age    city
0   shruti   25  Mumbai
1    soham   30    pune
2  nandini   45   dhule
<class 'pandas.core.frame.DataFrame'>

In [7]:
import numpy as np
np.array(df)

array([['shruti', 25, 'Mumbai'],
       ['soham', 30, 'pune'],
       ['nandini', 45, 'dhule']], dtype=object)

In [8]:
#Create a Data frame from a list of dictionaries

data=[
    {'name':'Shruti','age':21,'city':'mumbai'},
    {'name':'Soham','age':16,'city':'mumbai'},
    {'name':'nandini','age':22,'city':'mumbai'},
    {'name':'harshali','age':25,'city':'mumbai'},
]
df=pd.DataFrame(data)
print(df)

       name  age    city
0    Shruti   21  mumbai
1     Soham   16  mumbai
2   nandini   22  mumbai
3  harshali   25  mumbai

In [9]:
df=pd.read_csv('annual-enterprise-survey-2024-financial-year-provisional.csv')
df.head(5)

,Year,Industry_aggregation_NZSIOC,Industry_code_NZSIOC,Industry_name_NZSIOC,Units,Variable_code,Variable_name,Variable_category,Value,Industry_code_ANZSIC06
0,2024,Level 1,99999,All industries,Dollars (millions),H01,Total income,Financial performance,979594,ANZSIC06 divisions A-S (excluding classes K633...
1,2024,Level 1,99999,All industries,Dollars (millions),H04,"Sales, government funding, grants and subsidies",Financial performance,838626,ANZSIC06 divisions A-S (excluding classes K633...
2,2024,Level 1,99999,All industries,Dollars (millions),H05,"Interest, dividends and donations",Financial performance,112188,ANZSIC06 divisions A-S (excluding classes K633...
3,2024,Level 1,99999,All industries,Dollars (millions),H07,Non-operating income,Financial performance,28781,ANZSIC06 divisions A-S (excluding classes K633...
4,2024,Level 1,99999,All industries,Dollars (millions),H08,Total expenditure,Financial performance,856960,ANZSIC06 divisions A-S (excluding classes K633...

In [10]:
# Accessing data from dataframe
data
df=pd.DataFrame(data)
df

       name  age    city
0    Shruti   21  mumbai
1     Soham   16  mumbai
2   nandini   22  mumbai
3  harshali   25  mumbai

In [11]:
df['name']

0      Shruti
1       Soham
2     nandini
3    harshali
Name: name, dtype: object

In [12]:
df.loc[0][2]

C:\Users\SHRUTI\AppData\Local\Temp\ipykernel_22160\2880214942.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[0][2]

'mumbai'

In [13]:
df.iloc[0][2]

C:\Users\SHRUTI\AppData\Local\Temp\ipykernel_22160\2519637664.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][2]

'mumbai'

In [14]:
df

       name  age    city
0    Shruti   21  mumbai
1     Soham   16  mumbai
2   nandini   22  mumbai
3  harshali   25  mumbai

In [15]:
#Accessing a specific elements

df.at[1,'age']

np.int64(16)

In [16]:
df.at[2,'name']

'nandini'

In [17]:
#Accessing a specific elements using iat

df.iat[2,2]

'mumbai'

In [18]:
#Data Manipulation with dataframe 
df

       name  age    city
0    Shruti   21  mumbai
1     Soham   16  mumbai
2   nandini   22  mumbai
3  harshali   25  mumbai

In [ ]:
#Adding a column
df['salary']=[50000,60000,70000,80000]
df

       name  age    city  salary
0    Shruti   21  mumbai   50000
1     Soham   16  mumbai   60000
2   nandini   22  mumbai   70000
3  harshali   25  mumbai   80000

In [ ]:
#remove a column (This is temporary opeartion)
df.drop('salary',axis=1)

       name  age    city
0    Shruti   21  mumbai
1     Soham   16  mumbai
2   nandini   22  mumbai
3  harshali   25  mumbai

In [22]:
df

       name  age    city  salary
0    Shruti   21  mumbai   50000
1     Soham   16  mumbai   60000
2   nandini   22  mumbai   70000
3  harshali   25  mumbai   80000

In [ ]:
#For removing column permantaly
df.drop('salary',axis=1,inplace=True)

In [25]:
df

       name  age    city
0    Shruti   21  mumbai
1     Soham   16  mumbai
2   nandini   22  mumbai
3  harshali   25  mumbai

In [27]:
# Add age to the column
df['age']=df['age']+1
df

       name  age    city
0    Shruti   22  mumbai
1     Soham   17  mumbai
2   nandini   23  mumbai
3  harshali   26  mumbai

In [28]:
df.drop(0,inplace=True)

In [ ]:
df